In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('./EMSI_JobChange_UK_1.csv', sep=';')

# Завдання

## Про що дані

Якщо звернути увагу на таблицю нижче, то можемо побачити, що працюємо з даними про робочі місця в містах Англії. Для кожного міста ми знаємо кількість місць для кожної індустрії в 2011 та 2014 роках. Також знаємо різницю між робочими місцями за ці роки.

In [3]:
df.head()

,City,Country,SIC Code,Industry,Jobs2011,Jobs2014,Change,% Change,Unnamed: 8
0,Aberdeen,UK,M,"PROFESSIONAL, SCIENTIFIC AND TECHNICAL ACTIVITIES",33 510,34 729,1 219,"3,6%",NaN
1,Aberdeen,UK,Q,HUMAN HEALTH AND SOCIAL WORK ACTIVITIES,35 520,34 555,-965,"-2,7%",NaN
2,Aberdeen,UK,G,WHOLESALE AND RETAIL TRADE; REPAIR OF MOTOR VE...,34 231,34 065,-166,"-0,4%",NaN
3,Aberdeen,UK,N,ADMINISTRATIVE AND SUPPORT SERVICE ACTIVITIES,22 344,29 561,7 217,"32,2%",NaN
4,Aberdeen,UK,B,MINING AND QUARRYING,26 210,28 120,1 910,"7,2%",NaN

## 1. Виправити недоліки в даних

Видаляємо непотрібний стовпчик

In [4]:
df = df.drop('Unnamed: 8', axis='columns')

Забираємо знак відсотка з чисел, та замінюємо кому на крапку

In [5]:
df['% Change'] = df['% Change'].str.replace('%', '').str.replace(',', '.')

Видаємо пробіли в числах зазначених стовпчиків

In [6]:
cols = ['Jobs2011', 'Jobs2014', 'Change', '% Change']
for col in cols[:-1]:
    df[col] = df[col].str.replace(' ', '')

Конвертуємо строки в числа

In [7]:
df.loc[:, cols] = df.loc[:, cols].apply(pd.to_numeric)

Ось так виглядає оброблена таблиця

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 304 entries, 0 to 303
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   City      304 non-null    object
 1   Country   304 non-null    object
 2   SIC Code  304 non-null    object
 3   Industry  304 non-null    object
 4   Jobs2011  304 non-null    int64
 5   Jobs2014  304 non-null    int64
 6   Change    304 non-null    int64
 7   % Change  304 non-null    float64
dtypes: float64(1), int64(3), object(4)
memory usage: 19.1+ KB

In [9]:
df.head()

,City,Country,SIC Code,Industry,Jobs2011,Jobs2014,Change,% Change
0,Aberdeen,UK,M,"PROFESSIONAL, SCIENTIFIC AND TECHNICAL ACTIVITIES",33510,34729,1219,3.6
1,Aberdeen,UK,Q,HUMAN HEALTH AND SOCIAL WORK ACTIVITIES,35520,34555,-965,-2.7
2,Aberdeen,UK,G,WHOLESALE AND RETAIL TRADE; REPAIR OF MOTOR VE...,34231,34065,-166,-0.4
3,Aberdeen,UK,N,ADMINISTRATIVE AND SUPPORT SERVICE ACTIVITIES,22344,29561,7217,32.2
4,Aberdeen,UK,B,MINING AND QUARRYING,26210,28120,1910,7.2

## 2. Зберегти у `.csv` файл найкращі міста за працевлаштуванням у 2011 році за галузями. В якому місті, яка галузь найкраща за працевлаштуванням.

Групуємо за містом, та в кожному місті визначаємо індекс галузі з найбільшою к-стю міст

In [10]:
idx = df.groupby('City')['Jobs2011'].idxmax()
best_cities_2011 = df.loc[idx, ['City', 'Industry', 'Jobs2011']].reset_index(drop=True)

In [11]:
best_cities_2011.head()

,City,Industry,Jobs2011
0,Aberdeen,HUMAN HEALTH AND SOCIAL WORK ACTIVITIES,35520
1,Birmingham,WHOLESALE AND RETAIL TRADE; REPAIR OF MOTOR VE...,145911
2,Brighton,WHOLESALE AND RETAIL TRADE; REPAIR OF MOTOR VE...,53718
3,Bristol,WHOLESALE AND RETAIL TRADE; REPAIR OF MOTOR VE...,97499
4,Cardiff-Newport,HUMAN HEALTH AND SOCIAL WORK ACTIVITIES,89250

Зберігаємо у `.csv` файл

In [12]:
best_cities_2011.to_csv('best_cities_2011.csv', index=False)

## 3. Зберегти у `.csv` файл галузі з найгіршим приростом по містах. Яка галузь має найгірший приріст у якому місті.

Групуємо по галузі, і для кожної галузі беремо індекс з найгіршою зміною.

In [13]:
idx = df.groupby('Industry')['Change'].idxmin()
worst_industries = df.loc[idx, ['Industry', 'City', 'Change']].reset_index(drop=True)

In [14]:
worst_industries.head()

                                        Industry                  City  Change
0      ACCOMMODATION AND FOOD SERVICE ACTIVITIES  Newcastle-Sunderland   -6739
1  ADMINISTRATIVE AND SUPPORT SERVICE ACTIVITIES               Bristol   -6447
2              AGRICULTURE, FORESTRY AND FISHING             Edinburgh   -1353
3             ARTS, ENTERTAINMENT AND RECREATION               Glasgow   -2682
4                                   CONSTRUCTION               Glasgow   -3887

Зберігаємо у `.csv` файл

In [15]:
worst_industries.to_csv('worst_industries.csv', index=False)